In [34]:
import pandas as pd
import numpy as np

In [32]:
df = pd.DataFrame([[3,56,45,97],[1,456,6546,34],[4,45645,535,23],[2,345,636,345]], columns=['0','1','2','3'])
df

   0      1     2    3
0  3     56    45   97
1  1    456  6546   34
2  4  45645   535   23
3  2    345   636  345

In [24]:
df.columns[0]

'0'

In [33]:
df = df.set_index([df.columns[0]]).sort_index()
df

       1     2    3
0
1    456  6546   34
2    345   636  345
3     56    45   97
4  45645   535   23

In [5]:
df = df.sort_index()
df

       1     2    3
0
1    456  6546   34
2    345   636  345
3     56    45   97
4  45645   535   23

In [36]:
ar = np.array(df)
ar = np.expand_dims(ar, axis=2)
ar

array([[[  456],
        [ 6546],
        [   34]],

       [[  345],
        [  636],
        [  345]],

       [[   56],
        [   45],
        [   97]],

       [[45645],
        [  535],
        [   23]]])